{
  "astronaut": {
    "greeting": "Привет!"
  },
  "page-indicator": {
    "about": "Обо мне",
    "projects": "Проекты",
    "resume": "Опыт",
    "life": "Жизнь"
  },
  "about": {
    "name": "Рубен Кристеа",
    "tagline": "Инженер-программист · Ведущий инженер · Я вечно по уши в делах",
    "description": "Архитектура крупномасштабных систем и интеллектуальных платформ. Преобразование устаревших сложных задач в упрощенную и модульную инфраструктуру."
  },
  "resume": {
    "title": "Опыт",
    "summary": "Целеустремленный инженер-программист с более чем 5-летним опытом разработки высокопроизводительных приложений и решения сложных задач инфраструктуры кода. Опыт в архитектуре, реализации, тестировании и поддержке программных решений.",
    "experience": {
      "ncr-voyix-lead": {
        "role": "Инженер-программист II (Ведущий Frontend-разработчик)",
        "company": "NCR Voyix · Атланта, Джорджия",
        "date": "Август 2025 - Настоящее время",
        "bullet1": "Руководил командой инженеров для передовой AI-платформы точки продаж, ориентированной от малого бизнеса до крупных предприятий. Спроектировал и реализовал frontend-архитектуру для конфигурационного рендерера, динамически компонующего UI во время выполнения.",
        "bullet2": "Набрал и адаптировал высокопроизводительную инженерную команду, координировал техническое направление с backend, продуктом и UX, проводил инженерное планирование и распределение задач, демонстрировал прогресс руководству C-уровня.",
        "bullet3": "Создал прототип drag-and-drop редактора для валидации UX билдера перед полной реализацией и определил движок layout/рендеринга. Награжден опционами от CTO в знак признания лидерства и влияния."
      },
      "ncr-voyix": {
        "role": "Инженер-программист II",
        "company": "NCR Voyix · Атланта, Джорджия",
        "date": "Июнь 2024 - Август 2025",
        "bullet1": "Возглавил исследование и разработку инновационной облачной платформы с модульной federation micro frontend веб-платформой, предназначенной для поддержки как новых, так и устаревших приложений.",
        "bullet2": "Проложил путь к единой экосистеме разработки для оптимизации операций и содействия сотрудничеству между командами NCR с использованием разработанной мной платформы.",
        "bullet3": "Разработал приложение для управления бэк-офисом на основе микросервисов с использованием React, NestJS и TypeScript. Обеспечил масштабируемость и адаптивность, превысив цели проекта."
      },
      "ibm-weather": {
        "role": "Инженер-программист",
        "company": "IBM | The Weather Company · Атланта, Джорджия",
        "date": "Март 2023 - Июнь 2024",
        "bullet1": "Разработал высокопроизводительные, управляемые данными пользовательские интерфейсы для веб-приложений, используя современные фреймворки для обеспечения надежной целостности данных и эффективных асинхронных операций.",
        "bullet2": "Выполнил миграцию критически важной веб-инфраструктуры с IBM Cloud на AWS, улучшил масштабируемость и устойчивость системы, обеспечив увеличение максимального числа запросов в секунду на 50%.",
        "bullet3": "Спроектировал и оптимизировал cron-задачи для критических операций, сократив задачи генерации радара на 90%. Возглавил разработку POC для нового TV-приложения, открыв новые бизнес-возможности."
      },
      "talitrix": {
        "role": "Инженер-программист",
        "company": "Talitrix · Альфаретта, Джорджия",
        "date": "Август 2022 - Март 2023",
        "bullet1": "Разработал и поддерживал критически важную инфраструктуру данных местоположения в Talitrix, обеспечивая безопасность жертв путем точного отслеживания и мониторинга лиц высокого риска через строгое управление данными.",
        "bullet2": "Спроектировал и реализовал алгоритмы обработки и анализа данных местоположения с аппаратных устройств, производя данные о соответствии и нарушениях в реальном времени для приложений электронного мониторинга.",
        "bullet3": "Создал надежную backend-систему с использованием Django, Django REST Framework и PostgreSQL для обработки больших объемов данных местоположения, реализовав сложные алгоритмы для комендантского часа и зон исключения."
      },
      "carcareers": {
        "role": "Full Stack инженер-программист",
        "company": "CARCAREERS.COM · Удаленно, США",
        "date": "Август 2020 - Март 2023",
        "bullet1": "Спроектировал масштабируемые решения, включая алгоритмы и системный дизайн, в структуре монорепозитория (React frontend, NestJS backend) для удовлетворения развивающихся бизнес-требований.",
        "bullet2": "Разработал программные решения на протяжении всего жизненного цикла разработки, соблюдая стандарты компании, используя структуру монорепозитория и развертывая в GKE.",
        "bullet3": "Возглавил команду инженеров и дизайнеров в разработке новой фазы платформы, значительно улучшив масштабируемость и пользовательский опыт для общенационального расширения."
      },
      "uga-gavel": {
        "role": "Ассистент лаборатории разработки ПО",
        "company": "Университет Джорджии - GAVEL Lab · Атенс, Джорджия",
        "date": "Январь 2022 - Март 2023",
        "bullet1": "Частичная занятость в лаборатории игр и виртуальных сред UGA. Проектировал и создавал виртуальные среды на Unity и C# по заданию исследователей для лучшего понимания влияния виртуальных сред на людей.",
        "bullet2": "Создал среды для тестирования технологии отслеживания лица и глаз HP Reverb G2 Omnicept Edition для изучения новых возможностей будущих исследовательских проектов.",
        "bullet3": "Сотрудничал с исследовательскими командами для создания иммерсивных VR-опытов для академических исследований восприятия и поведения человека в виртуальных средах."
      }
    },
    "skills": {
      "languages": {
        "title": "Языки Программирования",
        "list": "TypeScript, JavaScript, Go, C++, Python, HTML5, CSS, Kotlin"
      },
      "software": {
        "title": "Программное Обеспечение и Технологии",
        "frameworks": {
          "label": "Фреймворки/Библиотеки",
          "items": "React, Redux, NX, NestJS, Astro, Django, Node"
        },
        "ai": {
          "label": "AI Инструменты",
          "items": "GitHub Copilot, Claude"
        },
        "database": {
          "label": "Базы Данных",
          "items": "SQL, Postgres, Redis, CouchDB, Ditto, MongoDB"
        },
        "architecture": {
          "label": "Архитектура",
          "items": "Kubernetes, Docker, Jenkins, Terraform"
        },
        "platforms": {
          "label": "Платформы",
          "items": "Google Cloud Platform, AWS, Windows, Mac OS X, Linux, Unix, Android, iOS"
        },
        "vcs": {
          "label": "VCS",
          "items": "Git, PlasticSCM"
        },
        "sdlc": {
          "label": "SDLC Инструменты",
          "items": "Jira, Azure DevOps, GitHub"
        }
      }
    },
    "education": {
      "title": "Образование",
      "school": "Университет Джорджии",
      "location": "Атенс, Джорджия",
      "degree": "Бакалавр Наук",
      "major": "Информатика",
      "honors": "Cum Laude"
    }
  },
  "projects": {
    "title": "Проекты",
    "subtitle": "Коллекция проектов, которые я создал и в которых участвовал.",
    "adk": {
      "title": "Agentic Development Kit",
      "description": "Открытый инструментарий для создания интеллектуальных AI-агентов с постоянной памятью, семантическим поиском и оркестрацией инструментов. Включает движок памяти с векторным хранилищем Redis, интеграцию LLM и модульный фреймворк для агентов."
    },
    "excelsus-data": {
      "title": "Excelsus Data",
      "description": "Сооснователь компании по проверке биографических данных, революционизирующей отрасль с помощью передовых технологий. Обеспечивает более быстрые, точные и доступные услуги скрининга с сокращением затрат на 50%, обработкой в 10 раз быстрее и точностью 99.9%."
    },
    "carcareers": {
      "title": "CARCAREERS.COM",
      "description": "Создал платформу по трудоустройству #1 для автомобильной индустрии США в качестве CTO. Полностековая платформа, связывающая соискателей с работодателями в автоиндустрии, которая составляет до 1/3 всех рабочих мест в США, с веб- и мобильными приложениями."
    },
    "portfolio": {
      "title": "Сайт-портфолио",
      "description": "Личное портфолио, созданное на Astro, с интерактивной хронологией, плавными анимациями на GSAP и современной тёмной темой. Демонстрирует историю карьеры с уникальной визуализацией ветвления."
    },
    "github-more": {
      "title": "Больше на GitHub",
      "description": "Изучите больше моих открытых проектов, вкладов и экспериментов на GitHub."
    },
    "oj-studios": {
      "title": "Orange Juice Studios",
      "description": "Страстный проект по созданию инновационных видеоигр. Создаю открытые XR мультиплеерные игры на Unity и кросс-платформенные игры на Godot. Творческий выход, к которому планирую вернуться."
    }
  }
}
